nodejszuoye/node-P6/test/stress-test-report.txt
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 154.8.159.184 (be patient)


Server Software:        
Server Hostname:        154.8.159.184
Server Port:            3000

Document Path:          /api/blog_list
Document Length:        604 bytes

Concurrency Level:      100
Time taken for tests:   9.807 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      725000 bytes
HTML transferred:       604000 bytes
Requests per second:    101.97 [#/sec] (mean)
Time per request:       980.725 [ms] (mean)
Time per request:       9.807 [ms] (mean, across all concurrent requests)
Transfer rate:          72.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        8   42 247.1     11    2413
Processing:    10  712 1618.3    231    8196
Waiting:       10  699 1622.7    142    8196
Total:         20  754 1646.3    242    8972

Percentage of the requests served within a certain time (ms)
  50%    242
  66%    279
  75%    366
  80%    665
  90%   1950
  95%   6518
  98%   7374
  99%   7533
 100%   8972 (longest request)